# Strict — must succeed. These are the must-have CLI tools for shell, stow,
# git, mise, neovim, tmux. If anything here fails, 'make brew' aborts.
# Everything else (langs, dev tools, casks, MAS apps) lives in
# Brewfile.optional and runs best-effort.

# CLI — core
brew "atuin"
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gum"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "mise"
brew "neovim"
brew "pnpm"
brew "postgresql@17"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "tldr"
brew "tree"
brew "yarn"
brew "zoxide"

# CLI — TUI / system
brew "btop"
brew "dust"
brew "yazi"

# Zsh plugins
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
