# Best-effort — failures are collected and printed as a summary at the end of
# 'make brew' but do not abort. Add new casks / niche tools here.

# Go development
brew "buf"
brew "delve"
brew "golangci-lint"
brew "grpcurl"
brew "protobuf"

# Languages / package tools
brew "oven-sh/bun/bun"
brew "uv"
brew "rust"

# Linters / formatters
brew "hadolint"
brew "markdownlint-cli"
brew "sqlfluff"

# Networking / security
brew "cloudflared"
brew "mkcert"
brew "nikto"
brew "nmap"
brew "nuclei"
brew "testssl"

# Cloud / data
brew "ansible"
brew "awscli"
brew "supabase/tap/supabase"

# Media
brew "ffmpeg"

# Alt terminal multiplexer
brew "zellij"

# Casks — productivity
cask "1password"
cask "1password-cli"
cask "bartender"
cask "betterzip"
cask "chatgpt"
cask "claude"
cask "fantastical"
cask "obsidian"
cask "raycast"

# Casks — browsers
cask "brave-browser"
cask "firefox"

# Casks — communication
cask "discord"
cask "signal"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "zoom"

# Casks — dev tools
cask "alacritty"
cask "codex"
cask "cursor"
cask "docker-desktop"
cask "ghostty"
cask "goland"
cask "iterm2"
cask "sublime-text"
cask "visual-studio-code"

# Casks — design
cask "figma"
cask "imagealpha"
cask "imageoptim"

# Casks — file sync
cask "dropbox"
cask "google-drive"

# Casks — media
cask "spotify"
cask "vlc"

# Casks — system / utilities
cask "expressvpn"
cask "folx"
cask "gcloud-cli"
cask "microsoft-office"
cask "nordvpn"
cask "sip-app"

# Casks — fonts
cask "font-jetbrains-mono-nerd-font"

# Mac App Store
mas "Todoist", id: 585829637
# mas "Xcode",  id: 497799835
