# CLI — core
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "mise"
brew "neovim"
brew "pnpm"
brew "postgresql@17"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "yarn"

# CLI — TUI / system
brew "btop"
brew "dust"
brew "yazi"

# Zsh plugins
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Go development
brew "buf"
brew "delve"
brew "golangci-lint"
brew "grpcurl"
brew "protobuf"

# Languages / package tools
brew "pipx"
brew "python@3.12"
brew "ruby"
brew "rust"

# Linters / formatters
brew "hadolint"
brew "markdownlint-cli"
brew "sqlfluff"

# Networking / security
brew "cloudflared"
brew "grype"
brew "mkcert"
brew "nikto"
brew "nmap"
brew "nuclei"
brew "testssl"

# Casks — productivity
cask "1password"
cask "alfred"
cask "bartender"
cask "betterzip"
cask "fantastical"
cask "tresorit"

# Casks — browsers
cask "brave-browser"
cask "firefox"

# Casks — communication
cask "discord"
cask "signal"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "zoom"

# Casks — dev tools
cask "alacritty"
cask "codeql"
cask "codex"
cask "cursor"
cask "docker-desktop"
cask "ghostty"
cask "goland"
cask "hyper"
cask "intellij-idea"
cask "iterm2"
cask "postman"
cask "sublime-text"
cask "visual-studio-code"

# Casks — design
cask "figma"
cask "imagealpha"
cask "imageoptim"
cask "sketch"
cask "zeplin"

# Casks — file sync
cask "dropbox"
cask "google-drive"

# Casks — media
cask "spotify"
cask "vlc"

# Casks — system / utilities
cask "aerospace"
cask "expressvpn"
cask "folx"
cask "gcloud-cli"
cask "microsoft-office"
cask "sip-app"

# Mac App Store
mas "Magnet", id: 441258766
mas "Bear", id: 1091189122
mas "Todoist", id: 585829637
# mas "Xcode", id: 497799835
