# CLI
brew "bat"
brew "eza"
brew "fzf"
brew "git"
brew "mas"
brew "mise"
brew "neovim"
brew "postgresql@17"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Casks
cask "1password"
cask "alfred"
cask "bartender"
cask "betterzip"
cask "brave-browser"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "expressvpn"
cask "fantastical"
cask "figma"
cask "firefox"
cask "folx"
cask "ghostty"
cask "goland"
cask "google-drive"
cask "hyper"
cask "imagealpha"
cask "imageoptim"
cask "intellij-idea"
cask "iterm2"
cask "microsoft-office"
cask "postman"
cask "signal"
cask "sketch"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "telegram"
cask "tresorit"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zeplin"
cask "zoom"

# Mac App Store
mas "Magnet", id: 441258766
mas "Bear", id: 1091189122
mas "Todoist", id: 585829637
# mas "Xcode", id: 497799835
